---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.MomentOfInertiaStrongAxis
source: html/bf4d9782-9bfc-2b15-445a-0722602918f6.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.MomentOfInertiaStrongAxis Property

Moment of Inertia about main strong axis (I).

## Syntax (C#)
```csharp
public double MomentOfInertiaStrongAxis { get; set; }
```